{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 11, 100], "unit_forget_bias": true, "return_state": false, "unroll": false, "units": 120, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "name": "lstm_3", "go_backwards": false, "recurrent_regularizer": null, "activation": "tanh", "recurrent_dropout": 0.2, "stateful": false, "implementation": 1}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "recurrent_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "tanh", "return_state": false, "unroll": false, "units": 100, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "name": "lstm_4", "go_backwards": false, "recurrent_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "stateful": false, "implementation": 1}}, "trainable": true, "name": "bidirectional_2"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "name": "dense_5", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "units": 2429, "kernel_constraint": null, "bias_constraint": null}}, "trainable": true, "name": "time_distributed_5"}}]}